pnt325/EFR32BG22-Thunerboard-ICM20648-DMP-QUATER_6/base_project_thunderboard_mcu/sensor.c
/*
* ________________________________________________________________________________________________________
* Copyright (c) 2017 InvenSense Inc. All rights reserved.
*
* This software, related documentation and any modifications thereto (collectively �Software�) is subject
* to InvenSense and its licensors' intellectual property rights under U.S. and international copyright
* and other intellectual property rights laws.
*
* InvenSense and its licensors retain all intellectual property and proprietary rights in and to the Software
* and any use, reproduction, disclosure or distribution of the Software without an express license agreement
* from InvenSense is strictly prohibited.
*
* EXCEPT AS OTHERWISE PROVIDED IN A LICENSE AGREEMENT BETWEEN THE PARTIES, THE SOFTWARE IS
* PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED
* TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT.
* EXCEPT AS OTHERWISE PROVIDED IN A LICENSE AGREEMENT BETWEEN THE PARTIES, IN NO EVENT SHALL
* INVENSENSE BE LIABLE FOR ANY DIRECT, SPECIAL, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL DAMAGES, OR ANY
* DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT,
* NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE
* OF THE SOFTWARE.
* ________________________________________________________________________________________________________
*/
//#include <asf.h>

/* InvenSense drivers and utils */
#include <stdio.h>
#include <math.h>
#include <string.h>
#include "Invn/Devices/Drivers/Icm20648/Icm20648.h"
#include "Invn/Devices/Drivers/Icm20648/Icm20648MPUFifoControl.h"
#include "Invn/Devices/Drivers/Ak0991x/Ak0991x.h"
#include "Invn/Devices/SensorTypes.h"
#include "Invn/Devices/SensorConfig.h"
#include "Invn/EmbUtils/InvScheduler.h"
#include "Invn/EmbUtils/RingByteBuffer.h"
#include "Invn/EmbUtils/Message.h"
#include "Invn/EmbUtils/ErrorHelper.h"
#include "Invn/EmbUtils/DataConverter.h"
#include "Invn/EmbUtils/RingBuffer.h"
#include "Invn/DynamicProtocol/DynProtocol.h"
#include "Invn/DynamicProtocol/DynProtocolTransportUart.h"
#include "sl_uartdrv_instances.h"
#include "uartdrv.h"

#include "sl_sleeptimer.h"
#include "ustimer.h"

/* Atmel system */
#include "system.h"
/* TDK Sensor */
#include "sensor.h"

//#include "ASF/sam/drivers/pio/pio.h"
//#include "ASF/sam/drivers/pio/pio_handler.h"
//#include "ASF/sam/drivers/twi/twi.h"
//#include "ASF/sam/drivers/tc/tc.h"

#include "main.h"

#define PI M_PI

static const uint8_t dmp3_image[] = {
	#include "icm20648_img.dmp3a.h"
};

/*
* Just a handy variable to handle the icm20648 object
*/
inv_icm20648_t icm_device;

static const uint8_t EXPECTED_WHOAMI[] = { 0xE0 }; /* WHOAMI value for ICM20648 or derivative */

/* FSR configurations */
int32_t cfg_acc_fsr = 4; // Default = +/- 4g. Valid ranges: 2, 4, 8, 16
int32_t cfg_gyr_fsr = 2000; // Default = +/- 2000dps. Valid ranges: 250, 500, 1000, 2000

/*
* Mounting matrix configuration applied for both Accel and Gyro
*/
static const float cfg_mounting_matrix[9]= {
	1.f, 0, 0,
	0, 1.f, 0,
	0, 0, 1.f
};

/*
* Mounting matrix configuration applied for Mag
*/
static const float cfg_mag_mounting_matrix[9]= {
	1.f, 0, 0,
	0, 1.f, 0,
	0, 0, 1.f
};

static uint8_t convert_to_generic_ids[INV_ICM20648_SENSOR_MAX] = {
	INV_SENSOR_TYPE_ACCELEROMETER,
	INV_SENSOR_TYPE_GYROSCOPE,
	INV_SENSOR_TYPE_RAW_ACCELEROMETER,
	INV_SENSOR_TYPE_RAW_GYROSCOPE,
	INV_SENSOR_TYPE_UNCAL_MAGNETOMETER,
	INV_SENSOR_TYPE_UNCAL_GYROSCOPE,
	INV_SENSOR_TYPE_BAC,
	INV_SENSOR_TYPE_STEP_DETECTOR,
	INV_SENSOR_TYPE_STEP_COUNTER,
	INV_SENSOR_TYPE_GAME_ROTATION_VECTOR,
	INV_SENSOR_TYPE_ROTATION_VECTOR,
	INV_SENSOR_TYPE_GEOMAG_ROTATION_VECTOR,
	INV_SENSOR_TYPE_MAGNETOMETER,
	INV_SENSOR_TYPE_SMD,
	INV_SENSOR_TYPE_PICK_UP_GESTURE,
	INV_SENSOR_TYPE_TILT_DETECTOR,
	INV_SENSOR_TYPE_GRAVITY,
	INV_SENSOR_TYPE_LINEAR_ACCELERATION,
	INV_SENSOR_TYPE_ORIENTATION,
	INV_SENSOR_TYPE_B2S
};

/*
* Dynamic protocol and transport handles
*/
DynProtocol_t protocol;
DynProTransportUart_t transport;

/*
* Mask to keep track of enabled sensors
*/
static uint32_t enabled_sensor_mask = 0;

int ak09912_is_available = 0;

static void convert_sensor_event_to_dyn_prot_data(const inv_sensor_event_t * event, VSensorDataAny * vsensor_data);
static enum inv_icm20648_sensor idd_sensortype_conversion(int sensor);
static void icm20648_apply_mounting_matrix(void);
static void icm20648_set_fsr(void);
static uint8_t icm20648_get_grv_accuracy(void);

static void delay_ms(uint32_t ms)
{
	sl_sleeptimer_delay_millisecond(ms);
}

void delay_us(uint32_t us)
{
	USTIMER_Init();
	USTIMER_Delay(us);
	USTIMER_DeInit();
}

/*
* Sleep implementation for ICM20648
*/
void inv_icm20648_sleep(int ms) {
	delay_ms(ms);
}

void inv_icm20648_sleep_us(int us){
	delay_us(us);
}

int load_dmp3(void){
	int rc = 0;
	INV_MSG(INV_MSG_LEVEL_INFO, "Load DMP3 image");
	rc = inv_icm20648_load(&icm_device, dmp3_image, sizeof(dmp3_image));
	return rc;
}

void inv_icm20648_enable_dmp_quater_6()
{
	int rc;
	// Enable sensor: INV_ICM20648_SENSOR_GAME_ROTATION_VECTOR
	INV_MSG(INV_MSG_LEVEL_VERBOSE, "Enable sensor: INV_ICM20648_SENSOR_GAME_ROTATION_VECTOR");
	rc = inv_icm20648_enable_sensor(&icm_device, INV_ICM20648_SENSOR_GAME_ROTATION_VECTOR, 1);
	check_rc(rc, "inv_icm20648_enable_sensor: error");
	enabled_sensor_mask |= (1 << INV_ICM20648_SENSOR_GAME_ROTATION_VECTOR);

	// Set update period
	rc = inv_icm20648_set_sensor_period(&icm_device, INV_ICM20648_SENSOR_GAME_ROTATION_VECTOR, 50);
	check_rc(rc, "inv_icm20648_set_sensor_period: error");

	INV_MSG(0, "Enable INV_ICM20648_SENSOR_GAME_ROTATION_VECTOR: DMP_QUATER6");
}

static void icm20648_apply_mounting_matrix(void){
	int ii;

	for (ii = 0; ii < INV_ICM20648_SENSOR_MAX; ii++) {
		if (ii == INV_ICM20648_SENSOR_MAGNETIC_FIELD_UNCALIBRATED || ii == INV_ICM20648_SENSOR_GEOMAGNETIC_FIELD)
			inv_icm20648_set_matrix(&icm_device, cfg_mag_mounting_matrix, ii);
		else
			inv_icm20648_set_matrix(&icm_device, cfg_mounting_matrix, ii);
	}
}

static void icm20648_set_fsr(void){
	inv_icm20648_set_fsr(&icm_device, INV_ICM20648_SENSOR_RAW_ACCELEROMETER, (const void *)&cfg_acc_fsr);
	inv_icm20648_set_fsr(&icm_device, INV_ICM20648_SENSOR_ACCELEROMETER, (const void *)&cfg_acc_fsr);
	inv_icm20648_set_fsr(&icm_device, INV_ICM20648_SENSOR_RAW_GYROSCOPE, (const void *)&cfg_gyr_fsr);
	inv_icm20648_set_fsr(&icm_device, INV_ICM20648_SENSOR_GYROSCOPE, (const void *)&cfg_gyr_fsr);
	inv_icm20648_set_fsr(&icm_device, INV_ICM20648_SENSOR_GYROSCOPE_UNCALIBRATED, (const void *)&cfg_gyr_fsr);
}

