pnt325/EFR32BG22-Thunerboard-ICM20648-DMP-QUATER_6/base_project_thunderboard_mcu/sensor.c
static enum inv_icm20648_sensor idd_sensortype_conversion(int sensor){
	switch(sensor) {
	case INV_SENSOR_TYPE_RAW_ACCELEROMETER:       return INV_ICM20648_SENSOR_RAW_ACCELEROMETER;
	case INV_SENSOR_TYPE_RAW_GYROSCOPE:           return INV_ICM20648_SENSOR_RAW_GYROSCOPE;
	case INV_SENSOR_TYPE_ACCELEROMETER:           return INV_ICM20648_SENSOR_ACCELEROMETER;
	case INV_SENSOR_TYPE_GYROSCOPE:               return INV_ICM20648_SENSOR_GYROSCOPE;
	case INV_SENSOR_TYPE_UNCAL_MAGNETOMETER:      return INV_ICM20648_SENSOR_MAGNETIC_FIELD_UNCALIBRATED;
	case INV_SENSOR_TYPE_UNCAL_GYROSCOPE:         return INV_ICM20648_SENSOR_GYROSCOPE_UNCALIBRATED;
	case INV_SENSOR_TYPE_BAC:                     return INV_ICM20648_SENSOR_ACTIVITY_CLASSIFICATON;
	case INV_SENSOR_TYPE_STEP_DETECTOR:           return INV_ICM20648_SENSOR_STEP_DETECTOR;
	case INV_SENSOR_TYPE_STEP_COUNTER:            return INV_ICM20648_SENSOR_STEP_COUNTER;
	case INV_SENSOR_TYPE_GAME_ROTATION_VECTOR:    return INV_ICM20648_SENSOR_GAME_ROTATION_VECTOR;
	case INV_SENSOR_TYPE_ROTATION_VECTOR:         return INV_ICM20648_SENSOR_ROTATION_VECTOR;
	case INV_SENSOR_TYPE_GEOMAG_ROTATION_VECTOR:  return INV_ICM20648_SENSOR_GEOMAGNETIC_ROTATION_VECTOR;
	case INV_SENSOR_TYPE_MAGNETOMETER:            return INV_ICM20648_SENSOR_GEOMAGNETIC_FIELD;
	case INV_SENSOR_TYPE_SMD:                     return INV_ICM20648_SENSOR_WAKEUP_SIGNIFICANT_MOTION;
	case INV_SENSOR_TYPE_PICK_UP_GESTURE:         return INV_ICM20648_SENSOR_FLIP_PICKUP;
	case INV_SENSOR_TYPE_TILT_DETECTOR:           return INV_ICM20648_SENSOR_WAKEUP_TILT_DETECTOR;
	case INV_SENSOR_TYPE_GRAVITY:                 return INV_ICM20648_SENSOR_GRAVITY;
	case INV_SENSOR_TYPE_LINEAR_ACCELERATION:     return INV_ICM20648_SENSOR_LINEAR_ACCELERATION;
	case INV_SENSOR_TYPE_ORIENTATION:             return INV_ICM20648_SENSOR_ORIENTATION;
	case INV_SENSOR_TYPE_B2S:                     return INV_ICM20648_SENSOR_B2S;
	default:                                      return INV_ICM20648_SENSOR_MAX;
	}
}

int handle_command(enum DynProtocolEid eid, const DynProtocolEdata_t * edata, DynProtocolEdata_t * respdata){
	(void)respdata;

	int rc = 0;
	uint8_t whoami;
	const int sensor = edata->sensor_id;

	switch(eid) {
	case DYN_PROTOCOL_EID_GET_SW_REG:
		if(edata->d.command.regAddr == DYN_PROTOCOL_EREG_HANDSHAKE_SUPPORT)
			return InvEMDFrontEnd_isHwFlowCtrlSupportedHook();
		return 0;

	case DYN_PROTOCOL_EID_SETUP:
	{
		int i_sensor = INV_SENSOR_TYPE_MAX;
		INV_MSG(INV_MSG_LEVEL_DEBUG, "DeviceEmdWrapper: received command setup");

		/* Disable all sensors */
		while(i_sensor-- > 0) {
			rc = inv_icm20648_enable_sensor(&icm_device, idd_sensortype_conversion(i_sensor), 0);
		}

		/* Clear pio interrupt */
//		pio_clear(PIN_EXT_INTERRUPT_PIO, PIN_EXT_INTERRUPT_MASK);

		/* Re-init the device */
		rc = icm20648_sensor_setup();
		rc += load_dmp3();

		/* .. no sensors are reporting on setup */
		enabled_sensor_mask = 0;
		return rc;
	}

	case DYN_PROTOCOL_EID_WHO_AM_I:
		rc = inv_icm20648_get_whoami(&icm_device, &whoami);
		return (rc == 0) ? whoami : rc;

	case DYN_PROTOCOL_EID_RESET:
	{
		int i_sensor = INV_SENSOR_TYPE_MAX;
		INV_MSG(INV_MSG_LEVEL_DEBUG, "DeviceEmdWrapper: received command reset");

		/* Disable all sensors */
		while(i_sensor-- > 0) {
			rc = inv_icm20648_enable_sensor(&icm_device, idd_sensortype_conversion(i_sensor), 0);
		}

		/* Clear pio interrupt */
//		pio_clear(PIN_EXT_INTERRUPT_PIO, PIN_EXT_INTERRUPT_MASK);

		/* Soft reset */
		rc += inv_icm20648_soft_reset(&icm_device);

		/* --- Setup --- */
		/* Re-init the device */
		rc += icm20648_sensor_setup();
		rc += load_dmp3();

		/* All sensors stop reporting on reset */
		enabled_sensor_mask = 0;
		return rc;
	}

	case DYN_PROTOCOL_EID_PING_SENSOR:
		INV_MSG(INV_MSG_LEVEL_DEBUG, "DeviceEmdWrapper: received command ping(%s)", inv_sensor_2str(sensor));
		if((sensor == INV_SENSOR_TYPE_RAW_ACCELEROMETER)
			|| (sensor == INV_SENSOR_TYPE_RAW_GYROSCOPE)
			|| (sensor == INV_SENSOR_TYPE_ACCELEROMETER)
			|| (sensor == INV_SENSOR_TYPE_GYROSCOPE)
			|| (sensor == INV_SENSOR_TYPE_UNCAL_GYROSCOPE)
			|| (sensor == INV_SENSOR_TYPE_GAME_ROTATION_VECTOR)
			|| (sensor == INV_SENSOR_TYPE_GRAVITY)
			|| (sensor == INV_SENSOR_TYPE_LINEAR_ACCELERATION)
			|| (sensor == INV_SENSOR_TYPE_STEP_COUNTER)
			|| (sensor == INV_SENSOR_TYPE_BAC)
			|| (sensor == INV_SENSOR_TYPE_B2S)
			|| (sensor == INV_SENSOR_TYPE_SMD)
			|| (sensor == INV_SENSOR_TYPE_STEP_DETECTOR)
			|| (sensor == INV_SENSOR_TYPE_TILT_DETECTOR)
			|| (sensor == INV_SENSOR_TYPE_PICK_UP_GESTURE)
			) {
				return 0;
		} else if(((sensor == INV_SENSOR_TYPE_MAGNETOMETER)
			|| (sensor == INV_SENSOR_TYPE_UNCAL_MAGNETOMETER)
			|| (sensor == INV_SENSOR_TYPE_ROTATION_VECTOR)
			|| (sensor == INV_SENSOR_TYPE_GEOMAG_ROTATION_VECTOR))
			&& ak09912_is_available) {
				return 0;
		} else
			return INV_ERROR_BAD_ARG;

	case DYN_PROTOCOL_EID_SELF_TEST:
		INV_MSG(INV_MSG_LEVEL_DEBUG, "DeviceEmdWrapper: received command self_test(%s)", inv_sensor_2str(sensor));
		if(	(sensor == INV_SENSOR_TYPE_RAW_ACCELEROMETER || sensor == INV_SENSOR_TYPE_ACCELEROMETER) ||
			(sensor == INV_SENSOR_TYPE_RAW_GYROSCOPE || sensor == INV_SENSOR_TYPE_GYROSCOPE) ||
			(sensor == INV_SENSOR_TYPE_MAGNETOMETER && ak09912_is_available) ) {
				return icm20648_run_selftest();
		}
		else
			return INV_ERROR_BAD_ARG;
		break;

	case DYN_PROTOCOL_EID_START_SENSOR:
		INV_MSG(INV_MSG_LEVEL_DEBUG, "DeviceEmdWrapper: received command start(%s)", inv_sensor_2str(sensor));
		if (sensor > 0 && idd_sensortype_conversion(sensor) < INV_ICM20648_SENSOR_MAX) {
			/* Sensor data will be notified */
			rc = inv_icm20648_enable_sensor(&icm_device, idd_sensortype_conversion(sensor), 1);
			enabled_sensor_mask |= (1 << idd_sensortype_conversion(sensor));
			return rc;
		} else
			return INV_ERROR_NIMPL; /*this sensor is not supported*/

	case DYN_PROTOCOL_EID_STOP_SENSOR:
		INV_MSG(INV_MSG_LEVEL_DEBUG, "DeviceEmdWrapper: received command stop(%s)", inv_sensor_2str(sensor));
		if (sensor > 0 && idd_sensortype_conversion(sensor) < INV_ICM20648_SENSOR_MAX) {
			/* Sensor data will not be notified anymore */
			rc = inv_icm20648_enable_sensor(&icm_device, idd_sensortype_conversion(sensor), 0);
			enabled_sensor_mask &= ~(1 << idd_sensortype_conversion(sensor));
			return rc;
		} else
			return INV_ERROR_NIMPL; /*this sensor is not supported*/

	case DYN_PROTOCOL_EID_SET_SENSOR_PERIOD:
		INV_MSG(INV_MSG_LEVEL_DEBUG, "DeviceEmdWrapper: received command set_period(%d us)",edata->d.command.period);
		rc = inv_icm20648_set_sensor_period(&icm_device, idd_sensortype_conversion(sensor), edata->d.command.period / 1000);
		return rc;

	case DYN_PROTOCOL_EID_SET_SENSOR_CFG:
		INV_MSG(INV_MSG_LEVEL_DEBUG, "DeviceEmdWrapper: received command set_sensor_config(%s)", inv_sensor_2str(sensor));
		return INV_ERROR_NIMPL;

	case DYN_PROTOCOL_EID_CLEANUP:
	{
		int i_sensor = INV_SENSOR_TYPE_MAX;
		INV_MSG(INV_MSG_LEVEL_DEBUG, "DeviceEmdWrapper: received command cleanup");

		/* Disable all sensors on cleanup */
		while(i_sensor-- > 0) {
			rc = inv_icm20648_enable_sensor(&icm_device, idd_sensortype_conversion(i_sensor), 0);
		}

		/* Clear pio interrupt */
//		pio_clear(PIN_EXT_INTERRUPT_PIO, PIN_EXT_INTERRUPT_MASK);

		/* Soft reset */
		rc += inv_icm20648_soft_reset(&icm_device);

		/* All sensors stop reporting on cleanup */
		enabled_sensor_mask = 0;
		return rc;
	}

	default:
		return INV_ERROR_NIMPL;
	}
}

void inv_icm20648_get_st_bias(struct inv_icm20648 * s, int *gyro_bias, int *accel_bias, int * st_bias){
	(void)s;

	int axis, axis_sign;
	int gravity;
	int i, t;
	int check;
	int scale;

